

// @Research: To module or not to module.




#pragma once
#include "../Core/DataTypes.h"

enum PLAYER
{
	MAX_PLAYER = 4,
};

enum ENTITY
{
	ENTITY_MAIN,
	ENTITY_CLONE,
	MAX_ENTITY,
};

enum WEAPON_STATUS
{
	WEAPON_STATUS_READY,
	WEAPON_STATUS_ACTIVE,
	WEAPON_STATUS_RETURN,
	WEAPON_STATUS_END,
	WEAPON_STATUS_DISABLED,
};

enum MODE_
{
	MODE_EASY,
	MODE_NORMAL,
	MODE_HARD,
	MODE_VERY_HARD,
	MODE_DANTE_MUST_DIE,
	MAX_MODE,
};

enum CHAR_
{
	CHAR_DANTE,
	CHAR_BOB,
	CHAR_LADY,
	CHAR_VERGIL,
	CHAR_VOID = 255,
	MAX_CHAR = 4,
};

enum COSTUME_
{
	COSTUME_DANTE_DEFAULT,
	COSTUME_DANTE_DEFAULT_NO_COAT,
	COSTUME_DANTE_DEFAULT_TORN,
	COSTUME_DANTE_DMC1,
	COSTUME_DANTE_DMC1_NO_COAT,
	COSTUME_DANTE_SPARDA,
	COSTUME_DANTE_DEFAULT_TORN_INFINITE_MAGIC_POINTS,
	COSTUME_DANTE_SPARDA_INFINITE_MAGIC_POINTS,
	COSTUME_BOB_DEFAULT = 0,
	COSTUME_LADY_DEFAULT = 0,
	COSTUME_LADY_LEATHER_JUMPSUIT,
	COSTUME_VERGIL_DEFAULT = 0,
	COSTUME_VERGIL_DEFAULT_NO_COAT,
	COSTUME_VERGIL_DEFAULT_INFINITE_MAGIC_POINTS,
	COSTUME_VERGIL_SPARDA,
	COSTUME_VERGIL_SPARDA_INFINITE_MAGIC_POINTS,
	MAX_COSTUME = 8,
	MAX_COSTUME_DANTE = 8,
	MAX_COSTUME_BOB = 1,
	MAX_COSTUME_LADY = 2,
	MAX_COSTUME_VERGIL = 5,
};

enum DEVIL
{
	DEVIL_REBELLION,
	DEVIL_CERBERUS,
	DEVIL_AGNI_RUDRA,
	DEVIL_NEVAN,
	DEVIL_BEOWULF,
	DEVIL_SPARDA,
	DEVIL_NERO_ANGELO,
	DEVIL_YAMATO = 0,
	MAX_DEVIL = 7,
};

enum STYLE_
{
	STYLE_SWORDMASTER,
	STYLE_GUNSLINGER,
	STYLE_TRICKSTER,
	STYLE_ROYALGUARD,
	STYLE_QUICKSILVER,
	STYLE_DOPPELGANGER,

	ACTION_VERGIL_DARK_SLAYER_AIR_TRICK = 60,
	ACTION_VERGIL_DARK_SLAYER_TRICK_UP,
	ACTION_VERGIL_DARK_SLAYER_TRICK_DOWN,
	ACTION_VERGIL_NERO_ANGELO_COMBO_1_PART_1 = 70,
	ACTION_VERGIL_NERO_ANGELO_COMBO_1_PART_2,
	ACTION_VERGIL_NERO_ANGELO_COMBO_1_PART_3,
	ACTION_VERGIL_NERO_ANGELO_HELM_BREAKER,
	ACTION_VERGIL_NERO_ANGELO_HIGH_TIME,
	ACTION_VERGIL_NERO_ANGELO_HIGH_TIME_LAUNCH,
	ACTION_VERGIL_NERO_ANGELO_STINGER,
	ACTION_VERGIL_NERO_ANGELO_FIREBALL_1,
	ACTION_VERGIL_NERO_ANGELO_COMBO_2_PART_1 = 90,
	ACTION_VERGIL_NERO_ANGELO_COMBO_2_PART_2,
	ACTION_VERGIL_NERO_ANGELO_COMBO_2_PART_3,
	ACTION_VERGIL_NERO_ANGELO_DIVEKICK,
	ACTION_VERGIL_NERO_ANGELO_ROUNDHOUSE_KICK,
	ACTION_VERGIL_NERO_ANGELO_UPPERCUT,
	ACTION_VERGIL_NERO_ANGELO_FIREBALL_2,
};

enum PERMISSION
{
	PERMISSION_UPDATE = 1,
	PERMISSION_WALK_RUN = 2,
	PERMISSION_JUMP_ROLL = 8,
	PERMISSION_TARGET = 0x10,
	PERMISSION_RELEASE = 0x20,
	PERMISSION_INTERACTION_STYLE_ATTACK = 0x400,
};

enum STATE
{
	STATE_ON_FLOOR = 1,
	STATE_IN_AIR = 2,
	STATE_BUSY = 0x10000,
};

//enum BODY_PART_
//{
//	BODY_PART_LOWER,
//	BODY_PART_UPPER,
//};

//enum MODEL_PART_
//{
//	MODEL_PART_BASE,
//	MODEL_PART_AMULET,
//	MODEL_PART_COAT,
//	MAX_MODEL_PART,
//};
//
//enum DEVIL_MODEL_PART_
//{
//	DEVIL_MODEL_PART_BASE,
//	DEVIL_MODEL_PART_WINGS,
//	DEVIL_MODEL_PART_COAT,
//	MAX_DEVIL_MODEL_PART,
//};




enum BODY_PART
{
	LOWER_BODY,
	UPPER_BODY,
	MAX_BODY_PART,
};




enum HUD_TOP
{
	HUD_TOP_UPPER_HIT_POINTS_FRAME,
	HUD_TOP_UPPER_HIT_POINTS_BAR,
	HUD_TOP_UPPER_HIT_POINTS_BACKGROUND,
	HUD_TOP_LOWER_HIT_POINTS_FRAME,
	HUD_TOP_LOWER_HIT_POINTS_BAR,
	HUD_TOP_LOWER_HIT_POINTS_BACKGROUND,
	HUD_TOP_MAGIC_ORBS,
	HUD_TOP_STYLE_ICON,
	HUD_TOP_RED_ORB_COUNTER,
	HUD_TOP_UNKNOWN_1,
	HUD_TOP_UNKNOWN_2,
	HUD_TOP_FLUX,
	HUD_TOP_UNKNOWN_3,
};

enum HUD_BOTTOM
{
	HUD_BOTTOM_RANGED_WEAPON_1,
	HUD_BOTTOM_RANGED_WEAPON_2,
	HUD_BOTTOM_MELEE_WEAPON_1,
	HUD_BOTTOM_MELEE_WEAPON_2,
};








// $CacheFileStart

enum CACHE_FILE
{
	pl000,
	pl011,
	pl013,
	pl015,
	pl016,
	pl018,
	pl005,
	pl006,
	pl007,
	pl008,
	pl009,
	pl017,
	pl000_00_0,
	pl000_00_1,
	pl000_00_2,
	pl000_00_3,
	pl000_00_4,
	pl000_00_5,
	pl000_00_6,
	pl000_00_7,
	pl000_00_8,
	pl000_00_9,
	pl000_00_10,
	pl000_00_11,
	pl000_00_12,
	pl000_00_13,
	pl000_00_14,
	pl000_00_15,
	pl000_00_16,
	pl000_00_17,
	pl000_00_18,
	pl000_00_19,
	pl000_00_20,
	pl000_00_21,
	pl000_00_22,
	pl000_00_23,
	pl000_00_24,
	pl000_00_25,
	pl000_00_26,
	plwp_sword,
	plwp_sword2,
	plwp_sword3,
	plwp_nunchaku,
	plwp_2sword,
	plwp_guitar,
	plwp_fight,
	plwp_gun,
	plwp_shotgun,
	plwp_laser,
	plwp_rifle,
	plwp_ladygun,
	pl001,
	pl001_00_0,
	pl001_00_1,
	pl001_00_2,
	pl001_00_31,
	plwp_vergilsword,
	pl002,
	pl002_00_0,
	pl002_00_1,
	pl002_00_2,
	pl021,
	pl023,
	pl026,
	pl010,
	pl014,
	pl025,
	pl021_00_0,
	pl021_00_1,
	pl021_00_2,
	pl021_00_3,
	pl021_00_4,
	pl021_00_5,
	pl021_00_6,
	pl021_00_7,
	pl021_00_8,
	pl021_00_9,
	plwp_newvergilsword,
	plwp_newvergilfight,
	plwp_forceedge,
	plwp_nerosword,
	em034,
	id100,
	id100V,
	MAX_CACHE_FILE,
};

struct CacheFileHelper
{
	const char * name;
	const char * type;
};

constexpr CacheFileHelper cacheFileHelper[MAX_CACHE_FILE] =
{
	{ "pl000.pac", "obj\\pl000.pac" },
	{ "pl011.pac", "obj\\pl011.pac" },
	{ "pl013.pac", "obj\\pl013.pac" },
	{ "pl015.pac", "obj\\pl015.pac" },
	{ "pl016.pac", "obj\\pl016.pac" },
	{ "pl018.pac", "obj\\pl018.pac" },
	{ "pl005.pac", "obj\\pl005.pac" },
	{ "pl006.pac", "obj\\pl006.pac" },
	{ "pl007.pac", "obj\\pl007.pac" },
	{ "pl008.pac", "obj\\pl008.pac" },
	{ "pl009.pac", "obj\\pl009.pac" },
	{ "pl017.pac", "obj\\pl017.pac" },
	{ "pl000_00_0.pac", "motion\\pl000\\pl000_00_0.pac" },
	{ "pl000_00_1.pac", "motion\\pl000\\pl000_00_1.pac" },
	{ "pl000_00_2.pac", "motion\\pl000\\pl000_00_2.pac" },
	{ "pl000_00_3.pac", "motion\\pl000\\pl000_00_3.pac" },
	{ "pl000_00_4.pac", "motion\\pl000\\pl000_00_4.pac" },
	{ "pl000_00_5.pac", "motion\\pl000\\pl000_00_5.pac" },
	{ "pl000_00_6.pac", "motion\\pl000\\pl000_00_6.pac" },
	{ "pl000_00_7.pac", "motion\\pl000\\pl000_00_7.pac" },
	{ "pl000_00_8.pac", "motion\\pl000\\pl000_00_8.pac" },
	{ "pl000_00_9.pac", "motion\\pl000\\pl000_00_9.pac" },
	{ "pl000_00_10.pac", "motion\\pl000\\pl000_00_10.pac" },
	{ "pl000_00_11.pac", "motion\\pl000\\pl000_00_11.pac" },
	{ "pl000_00_12.pac", "motion\\pl000\\pl000_00_12.pac" },
	{ "pl000_00_13.pac", "motion\\pl000\\pl000_00_13.pac" },
	{ "pl000_00_14.pac", "motion\\pl000\\pl000_00_14.pac" },
	{ "pl000_00_15.pac", "motion\\pl000\\pl000_00_15.pac" },
	{ "pl000_00_16.pac", "motion\\pl000\\pl000_00_16.pac" },
	{ "pl000_00_17.pac", "motion\\pl000\\pl000_00_17.pac" },
	{ "pl000_00_18.pac", "motion\\pl000\\pl000_00_18.pac" },
	{ "pl000_00_19.pac", "motion\\pl000\\pl000_00_19.pac" },
	{ "pl000_00_20.pac", "motion\\pl000\\pl000_00_20.pac" },
	{ "pl000_00_21.pac", "motion\\pl000\\pl000_00_21.pac" },
	{ "pl000_00_22.pac", "motion\\pl000\\pl000_00_22.pac" },
	{ "pl000_00_23.pac", "motion\\pl000\\pl000_00_23.pac" },
	{ "pl000_00_24.pac", "motion\\pl000\\pl000_00_24.pac" },
	{ "pl000_00_25.pac", "motion\\pl000\\pl000_00_25.pac" },
	{ "pl000_00_26.pac", "motion\\pl000\\pl000_00_26.pac" },
	{ "plwp_sword.pac", "obj\\plwp_sword.pac" },
	{ "plwp_sword2.pac", "obj\\plwp_sword2.pac" },
	{ "plwp_sword3.pac", "obj\\plwp_sword3.pac" },
	{ "plwp_nunchaku.pac", "obj\\plwp_nunchaku.pac" },
	{ "plwp_2sword.pac", "obj\\plwp_2sword.pac" },
	{ "plwp_guitar.pac", "obj\\plwp_guitar.pac" },
	{ "plwp_fight.pac", "obj\\plwp_fight.pac" },
	{ "plwp_gun.pac", "obj\\plwp_gun.pac" },
	{ "plwp_shotgun.pac", "obj\\plwp_shotgun.pac" },
	{ "plwp_laser.pac", "obj\\plwp_laser.pac" },
	{ "plwp_rifle.pac", "obj\\plwp_rifle.pac" },
	{ "plwp_ladygun.pac", "obj\\plwp_ladygun.pac" },
	{ "pl001.pac", "obj\\pl001.pac" },
	{ "pl001_00_0.pac", "motion\\pl001\\pl001_00_0.pac" },
	{ "pl001_00_1.pac", "motion\\pl001\\pl001_00_1.pac" },
	{ "pl001_00_2.pac", "motion\\pl001\\pl001_00_2.pac" },
	{ "pl001_00_31.pac", "motion\\pl001\\pl001_00_31.pac" },
	{ "plwp_vergilsword.pac", "obj\\plwp_vergilsword.pac" },
	{ "pl002.pac", "obj\\pl002.pac" },
	{ "pl002_00_0.pac", "motion\\pl002\\pl002_00_0.pac" },
	{ "pl002_00_1.pac", "motion\\pl002\\pl002_00_1.pac" },
	{ "pl002_00_2.pac", "motion\\pl002\\pl002_00_2.pac" },
	{ "pl021.pac", "obj\\pl021.pac" },
	{ "pl023.pac", "obj\\pl023.pac" },
	{ "pl026.pac", "obj\\pl026.pac" },
	{ "pl010.pac", "obj\\pl010.pac" },
	{ "pl014.pac", "obj\\pl014.pac" },
	{ "pl025.pac", "obj\\pl025.pac" },
	{ "pl021_00_0.pac", "motion\\pl021\\pl021_00_0.pac" },
	{ "pl021_00_1.pac", "motion\\pl021\\pl021_00_1.pac" },
	{ "pl021_00_2.pac", "motion\\pl021\\pl021_00_2.pac" },
	{ "pl021_00_3.pac", "motion\\pl021\\pl021_00_3.pac" },
	{ "pl021_00_4.pac", "motion\\pl021\\pl021_00_4.pac" },
	{ "pl021_00_5.pac", "motion\\pl021\\pl021_00_5.pac" },
	{ "pl021_00_6.pac", "motion\\pl021\\pl021_00_6.pac" },
	{ "pl021_00_7.pac", "motion\\pl021\\pl021_00_7.pac" },
	{ "pl021_00_8.pac", "motion\\pl021\\pl021_00_8.pac" },
	{ "pl021_00_9.pac", "motion\\pl021\\pl021_00_9.pac" },
	{ "plwp_newvergilsword.pac", "obj\\plwp_newvergilsword.pac" },
	{ "plwp_newvergilfight.pac", "obj\\plwp_newvergilfight.pac" },
	{ "plwp_forceedge.pac", "obj\\plwp_forceedge.pac" },
	{ "plwp_nerosword.pac", "obj\\plwp_nerosword.pac" },
	{ "em034.pac", "obj\\em034.pac" },
	{ "id100.pac", "id\\id100\\id100.pac" },
	{ "id100V.pac", "id\\id100\\id100V.pac" },
};

// $CacheFileEnd













enum SCENE
{
	SCENE_BOOT,
	SCENE_INTRO,
	SCENE_MAIN,
	SCENE_MISSION_SELECT,
	SCENE_LOAD,
	SCENE_GAME,
	SCENE_CUTSCENE,
	SCENE_MISSION_START,
	SCENE_MISSION_RESULT,
	SCENE_GAME_OVER,
	MAX_SCENE,
};

enum EVENT
{
	EVENT_INIT,
	EVENT_MAIN,
	EVENT_TELEPORT,
	EVENT_PAUSE,
	EVENT_STATUS,
	EVENT_OPTIONS,
	EVENT_DEATH,
	EVENT_GET_ITEM,
	EVENT_MESSAGE,
	EVENT_CUSTOMIZE,
	EVENT_SAVE,
	EVENT_DELETE,
	EVENT_END,
	MAX_EVENT,
};

enum SUBEVENT
{
	SUBEVENT_MISSION_START  = 7,
	SUBEVENT_MISSION_SELECT = 8,
};


























enum GAMEPAD
{
	GAMEPAD_VOID           = 0x0000,
	GAMEPAD_LEFT_TRIGGER   = 0x0001,
	GAMEPAD_RIGHT_TRIGGER  = 0x0002,
	GAMEPAD_LEFT_SHOULDER  = 0x0004,
	GAMEPAD_RIGHT_SHOULDER = 0x0008,
	GAMEPAD_Y              = 0x0010,
	GAMEPAD_B              = 0x0020,
	GAMEPAD_A              = 0x0040,
	GAMEPAD_X              = 0x0080,
	GAMEPAD_BACK           = 0x0100,
	GAMEPAD_LEFT_THUMB     = 0x0200,
	GAMEPAD_RIGHT_THUMB    = 0x0400,
	GAMEPAD_START          = 0x0800,
	// Direction ids are the same for dpad, left stick and right stick.
	GAMEPAD_UP             = 0x1000,
	GAMEPAD_RIGHT          = 0x2000,
	GAMEPAD_DOWN           = 0x4000,
	GAMEPAD_LEFT           = 0x8000,
	MAX_GAMEPAD = 4,
};

enum LEFT_STICK
{
	LEFT_STICK_DEADZONE = 52,
};

enum BINDING
{
	BINDING_ITEM_SCREEN,
	BINDING_EQUIP_SCREEN,
	BINDING_MAP_SCREEN,
	BINDING_FILE_SCREEN,
	BINDING_MELEE_ATTACK,
	BINDING_JUMP,
	BINDING_STYLE_ACTION,
	BINDING_SHOOT,
	BINDING_DEVIL_TRIGGER,
	BINDING_CHANGE_GUN,
	BINDING_CHANGE_TARGET,
	BINDING_LOCK_ON,
	BINDING_CHANGE_DEVIL_ARMS,
	BINDING_DEFAULT_CAMERA,
	BINDING_TAUNT,
};

enum SPEED_DEVIL_
{
	SPEED_DEVIL_DANTE_REBELLION,
	SPEED_DEVIL_DANTE_CERBERUS,
	SPEED_DEVIL_DANTE_AGNI_RUDRA,
	SPEED_DEVIL_DANTE_NEVAN,
	SPEED_DEVIL_DANTE_BEOWULF,
	SPEED_DEVIL_DANTE_SPARDA,
	SPEED_DEVIL_VERGIL_YAMATO = 8,
	SPEED_DEVIL_VERGIL_BEOWULF,
	SPEED_DEVIL_VERGIL_FORCE_EDGE,
	SPEED_DEVIL_NERO_ANGELO_YAMATO,
	SPEED_DEVIL_NERO_ANGELO_BEOWULF,
	SPEED_DEVIL_NERO_ANGELO_FORCE_EDGE,
};

enum ACTOR_EVENT
{
	ACTOR_EVENT_DANTE_DASH = 22,
	ACTOR_EVENT_DANTE_SKY_STAR,
	ACTOR_EVENT_DANTE_AIR_TRICK,
	ACTOR_EVENT_VERGIL_AIR_TRICK = 27,
	ACTOR_EVENT_VERGIL_TRICK_UP,
	ACTOR_EVENT_VERGIL_TRICK_DOWN,
};

enum ACTOR_MODE
{
	ACTOR_MODE_DEFAULT,
	ACTOR_MODE_MISSION_12,
	ACTOR_MODE_MISSION_18,
	ACTOR_MODE_MISSION_19,
};










#define IntroduceSizeStruct(size)\
struct Size_##size\
{\
	byte8 data[size];\
	operator byte8 *()\
	{\
		return reinterpret_cast<byte8 *>(this);\
	}\
}

#define _(size) struct { byte8 Prep_Merge(padding_, __LINE__)[size]; }

#pragma pack(push, 1)








struct ActorEventData
{
	uint32 index;
	uint32 lastIndex;
};



// $SessionDataStart

struct SESSION_DATA
{
	uint32 mission; // 0
	_(8);
	uint32 mode; // 0xC
	bool oneHitKill; // 0x10
	_(1);
	bool enableTutorial; // 0x12
	bool useGoldOrb; // 0x13
	_(8);
	bool bloodyPalace; // 0x1C
	_(24);
	uint8 goldOrbCount; // 0x35
	_(16);
	bool unlock[14]; // 0x46
	_(48);
	uint8 weapons[4]; // 0x84
	_(72);
	uint8 costume; // 0xD0
	bool unlockDevilTrigger; // 0xD1
	_(2);
	float32 hitPoints; // 0xD4
	float32 magicPoints; // 0xD8
	uint32 style; // 0xDC
	uint32 styleLevel[6]; // 0xE0
	float32 styleExperience[6]; // 0xF8
	byte32 expertise[8]; // 0x110
};

static_assert(offsetof(SESSION_DATA, mission) == 0);
static_assert(offsetof(SESSION_DATA, mode) == 0xC);
static_assert(offsetof(SESSION_DATA, oneHitKill) == 0x10);
static_assert(offsetof(SESSION_DATA, enableTutorial) == 0x12);
static_assert(offsetof(SESSION_DATA, useGoldOrb) == 0x13);
static_assert(offsetof(SESSION_DATA, bloodyPalace) == 0x1C);
static_assert(offsetof(SESSION_DATA, goldOrbCount) == 0x35);
static_assert(offsetof(SESSION_DATA, unlock) == 0x46);
static_assert(offsetof(SESSION_DATA, weapons) == 0x84);
static_assert(offsetof(SESSION_DATA, costume) == 0xD0);
static_assert(offsetof(SESSION_DATA, unlockDevilTrigger) == 0xD1);
static_assert(offsetof(SESSION_DATA, hitPoints) == 0xD4);
static_assert(offsetof(SESSION_DATA, magicPoints) == 0xD8);
static_assert(offsetof(SESSION_DATA, style) == 0xDC);
static_assert(offsetof(SESSION_DATA, styleLevel) == 0xE0);
static_assert(offsetof(SESSION_DATA, styleExperience) == 0xF8);
static_assert(offsetof(SESSION_DATA, expertise) == 0x110);

// $SessionDataEnd

struct EventData
{
	_(24);
	uint32 room;
	uint32 position;
	uint32 event;
	_(8);
	uint32 subevent;
};

struct NextEventData
{
	_(356);
	uint16 room;
	uint16 position;
};

struct StagePositionData
{
	uint8 event;
	_(3);
	float32 x;
	float32 y;
	float32 z;
	float32 rotation;
	_(28);
};











#define _IntroduceCameraData(name, ...)\
auto name = *reinterpret_cast<byte8 ***>(appBaseAddr + 0xC8FBD0);\
if (!name)\
{\
	__VA_ARGS__;\
}\
if (!name[147])\
{\
	__VA_ARGS__;\
}\
auto & cameraData = *reinterpret_cast<CAMERA_DATA *>(name[147])
#define IntroduceCameraData(...) _IntroduceCameraData(Prep_Merge(pool_, __LINE__), __VA_ARGS__)

#define _IntroduceHUDPointers(name, ...)\
auto name = *reinterpret_cast<byte8 **>(appBaseAddr + 0xC90E28);\
if (!name)\
{\
	__VA_ARGS__;\
}\
name -= 0x180;\
auto hudTop    = *reinterpret_cast<byte8 **>(name + 0x1B070);\
auto hudBottom = *reinterpret_cast<byte8 **>(name + 0x1B078)
#define IntroduceHUDPointers(...) _IntroduceHUDPointers(Prep_Merge(pool_, __LINE__), __VA_ARGS__)
/*
dmc3.exe+23E691 - 48 8D 93 80010000 - lea rdx,[rbx+00000180]
*/










// $MissionActorDataStart

struct QueuedMissionActorData
{
	uint8 weapons[5]; // 0
	_(75);
	float32 hitPoints; // 0x50
	float32 magicPoints; // 0x54
	uint32 style; // 0x58
	uint32 styleLevel[6]; // 0x5C
	float32 styleExperience[6]; // 0x74
	byte32 expertise[8]; // 0x8C
};

static_assert(offsetof(QueuedMissionActorData, weapons) == 0);
static_assert(offsetof(QueuedMissionActorData, hitPoints) == 0x50);
static_assert(offsetof(QueuedMissionActorData, magicPoints) == 0x54);
static_assert(offsetof(QueuedMissionActorData, style) == 0x58);
static_assert(offsetof(QueuedMissionActorData, styleLevel) == 0x5C);
static_assert(offsetof(QueuedMissionActorData, styleExperience) == 0x74);
static_assert(offsetof(QueuedMissionActorData, expertise) == 0x8C);

struct ActiveMissionActorData
{
	_(80);
	float32 hitPoints; // 0x50
	float32 magicPoints; // 0x54
	uint32 style; // 0x58
	uint32 styleLevel[6]; // 0x5C
	float32 styleExperience[6]; // 0x74
	byte32 expertise[8]; // 0x8C
};

static_assert(offsetof(ActiveMissionActorData, hitPoints) == 0x50);
static_assert(offsetof(ActiveMissionActorData, magicPoints) == 0x54);
static_assert(offsetof(ActiveMissionActorData, style) == 0x58);
static_assert(offsetof(ActiveMissionActorData, styleLevel) == 0x5C);
static_assert(offsetof(ActiveMissionActorData, styleExperience) == 0x74);
static_assert(offsetof(ActiveMissionActorData, expertise) == 0x8C);

// $MissionActorDataEnd

#define _IntroduceMissionActorData(name, ...)\
auto name = *reinterpret_cast<byte8 **>(appBaseAddr + 0xC90E30);\
if (!name)\
{\
	__VA_ARGS__;\
}\
auto & queuedMissionActorData = *reinterpret_cast<QueuedMissionActorData *>(name + 0xC0 );\
auto & activeMissionActorData = *reinterpret_cast<ActiveMissionActorData *>(name + 0x16C)
#define IntroduceMissionActorData(...) _IntroduceMissionActorData(Prep_Merge(pool_, __LINE__), __VA_ARGS__)












// #define _IntroduceMissionActorDataPointers(name, ...)\
// auto name = *reinterpret_cast<byte8 **>(appBaseAddr + 0xC90E30);\
// if (!name)\
// {\
// 	__VA_ARGS__;\
// }\
// auto missionActorData_C0  = reinterpret_cast<byte8 *>(name + 0xC0 );\
// auto missionActorData_16C = reinterpret_cast<byte8 *>(name + 0x16C)
// #define IntroduceMissionActorDataPointers(...) _IntroduceMissionActorDataPointers(Prep_Merge(pool_, __LINE__), __VA_ARGS__)







#define IntroduceSessionData() auto & sessionData = *reinterpret_cast<SESSION_DATA *>(appBaseAddr + 0xC8F250)

#define _IntroduceEventData(name, ...)\
auto name = *reinterpret_cast<byte8 ***>(appBaseAddr + 0xC90E10);\
if (!name)\
{\
	__VA_ARGS__;\
}\
if (!name[8])\
{\
	__VA_ARGS__;\
}\
auto & eventData = *reinterpret_cast<EventData *>(name[8])
#define IntroduceEventData(...) _IntroduceEventData(Prep_Merge(pool_, __LINE__), __VA_ARGS__)

#define _IntroduceNextEventData(name, ...)\
auto name = *reinterpret_cast<byte8 ***>(appBaseAddr + 0xC90E10);\
if (!name)\
{\
	__VA_ARGS__;\
}\
if (!name[12])\
{\
	__VA_ARGS__;\
}\
auto & nextEventData = *reinterpret_cast<NextEventData *>(name[12])
#define IntroduceNextEventData(...) _IntroduceNextEventData(Prep_Merge(pool_, __LINE__), __VA_ARGS__)

#define _IntroduceEventFlags(name, ...)\
auto name = *reinterpret_cast<byte8 ***>(appBaseAddr + 0xC90E30);\
if (!name)\
{\
	__VA_ARGS__;\
}\
if (!name[1])\
{\
	__VA_ARGS__;\
}\
auto eventFlags = reinterpret_cast<byte32 *>(name[1])
#define IntroduceEventFlags(...) _IntroduceEventFlags(Prep_Merge(pool_, __LINE__), __VA_ARGS__)

#define _IntroduceStagePositionData(name, ...)\
auto name = *reinterpret_cast<byte8 ***>(appBaseAddr + 0xC90E10);\
if (!name)\
{\
	__VA_ARGS__;\
}\
if (!name[8])\
{\
	__VA_ARGS__;\
}\
auto stagePositionData = *reinterpret_cast<StagePositionData **>(name[8] + 0x2CB0);\
if (!stagePositionData)\
{\
	__VA_ARGS__;\
}
#define IntroduceStagePositionData(...) _IntroduceStagePositionData(Prep_Merge(pool_, __LINE__), __VA_ARGS__)













































struct CAMERA_DATA
{
	_(176);
	byte8 * targetBaseAddr;
	_(24);
	float32 height;
	float32 tilt;
	float32 zoom;
};

static_assert(offsetof(CAMERA_DATA, targetBaseAddr) == 0xB0);
static_assert(offsetof(CAMERA_DATA, height) == 0xD0);
static_assert(offsetof(CAMERA_DATA, tilt) == 0xD4);
static_assert(offsetof(CAMERA_DATA, zoom) == 0xD8);











enum FILE_STATUS
{
	FILE_STATUS_READY = 3,
};

enum FILE_MODE
{
	FILE_MODE_MEMORY,
	FILE_MODE_ARCHIVE,
	FILE_MODE_LOCAL,
};




struct ArchiveData
{
	byte8 signature[4];
	uint32 fileCount;
	uint32 fileOff[128];
};

struct StringData
{
	_(8);
	const char * string;
};

struct FileData
{
	uint32 category;
	uint32 status;
	uint16 id;
	_(6);
	void * callback;
	StringData * stringData;
	byte8 * file;
	_(32);
};

























struct PS2_GAMEPAD
{
	_(16);
	uint8  vibration[4];
	byte16 buttons[6];
	uint8  rightStickX;
	uint8  rightStickY;
	uint8  leftStickX;
	uint8  leftStickY;
	_(12);
	uint16 rightStickDirection[4];
	uint16 leftStickDirection[4];
	uint16 rightStickDirectionFast[2];
	uint16 leftStickDirectionFast[2];
	uint16 rightStickPosition;
	uint16 leftStickPosition;
	uint16 rightStickDifference;
	uint16 leftStickDifference;
};

struct ENGINE_GAMEPAD
{
	byte16 buttons[4];
	uint16 buttonsTimer[2];
	uint16 rightStickDirection[4];
	uint16 rightStickTimer[2];
	uint16 rightStickPosition;
	uint16 rightStickRadius;
	uint16 leftStickDirection[4];
	uint16 leftStickTimer[2];
	uint16 leftStickPosition;
	uint16 leftStickRadius;
};
















struct MEMORY_OBJECT
{
	byte8 * addr;
	byte8 * end;
	uint32 last;
	uint32 boundary;
	uint32 size;
	uint32 pipe;
	uint32 count;
	byte8 padding[4];
};
















struct MotionData
{
	uint8 index;
	uint8 group;
};









struct InputData
{
	byte8 flags[8];
	float32 value;
};








struct ShadowData
{
	_(192);
};

static_assert(sizeof(ShadowData) == 0xC0);



struct PhysicsData
{
	_(240);
};

static_assert(sizeof(PhysicsData) == 0xF0);





struct PhysicsLinkData
{
	_(40);
	bool32 enable;
	_(4);
	PhysicsData * physicsData;
	_(72);
	vec4 data[4];
};

static_assert(offsetof(PhysicsLinkData, enable) == 0x28);
static_assert(offsetof(PhysicsLinkData, physicsData) == 0x30);
static_assert(offsetof(PhysicsLinkData, data) == 0x80);
static_assert(sizeof(PhysicsLinkData) == 0xC0);








struct PhysicsMetadata
{
	_(256);
	PhysicsLinkData * physicsLinkData;
	vec4 * vertices;
	PhysicsData * physicsData;
	_(40);
};

static_assert(offsetof(PhysicsMetadata, physicsLinkData) == 0x100);
static_assert(offsetof(PhysicsMetadata, vertices) == 0x108);
static_assert(offsetof(PhysicsMetadata, physicsData) == 0x110);
static_assert(sizeof(PhysicsMetadata) == 0x140);































//struct PhysicsLinkMetadata
//{
//	_(256);
//	PhysicsLinkData * devilPhysicsData;
//};

//static_assert(offsetof(PhysicsLinkMetadata, devilPhysicsData) == 0x100);
















struct BodyPartData
{
	_(288);
};

static_assert(sizeof(BodyPartData) == 0x120);

















//struct DevilPhysicsData
//{
//	DevilPhysicsMetadata metadata[2];
//
//
//
//
//
//
//
//
//
//
//
//
//};
//
//static_assert(sizeof(DevilPhysicsData) == 0x300);















struct ModelMetadata
{
	uint8 count;
	_(15);
	vec4 vertices[3];
	_(16);
};

static_assert(sizeof(ModelMetadata) == 80);






struct DevilModelMetadata
{
	uint8 modelIndex;
	uint8 modelPhysicsMetadataIndex;
};

struct DevilSubmodelMetadata
{
	uint8 submodelIndex;
	uint8 devilModelPhysicsMetadataIndex;
	uint8 devilSubmodelIndex;
};














struct DevilModelMetadata1 : DevilModelMetadata
{
	DevilSubmodelMetadata devilSubmodelMetadata;
};

struct DevilModelMetadata2 : DevilModelMetadata
{
	DevilSubmodelMetadata devilSubmodelMetadata[2];
};

struct DevilModelMetadataDante
{
	DevilModelMetadata2 Rebellion;
	DevilModelMetadata1 Cerberus;
	DevilModelMetadata  AgniRudra;
	DevilModelMetadata2 Nevan;
	DevilModelMetadata1 Beowulf;
	DevilModelMetadata1 Sparda;

	DevilModelMetadata2 & operator[](uint8 index)
	{
		switch (index)
		{
		case DEVIL_REBELLION:
		{
			return Rebellion;
		}
		case DEVIL_CERBERUS:
		{
			return *reinterpret_cast<DevilModelMetadata2 *>(&Cerberus);
		}
		case DEVIL_AGNI_RUDRA:
		{
			return *reinterpret_cast<DevilModelMetadata2 *>(&AgniRudra);
		}
		case DEVIL_NEVAN:
		{
			return Nevan;
		}
		case DEVIL_BEOWULF:
		{
			return *reinterpret_cast<DevilModelMetadata2 *>(&Beowulf);
		}
		case DEVIL_SPARDA:
		{
			return *reinterpret_cast<DevilModelMetadata2 *>(&Sparda);
		}
		}
		return Rebellion;
	}
};

static_assert(sizeof(DevilModelMetadataDante) == 33);





















enum DEVIL_FLUX_
{
	DEVIL_FLUX_START = 1,
	DEVIL_FLUX_END   = 2,
};









//constexpr uint16 File_costumeMapDante[MAX_COSTUME_DANTE] =
//{
//	pl000,
//	pl011,
//	pl013,
//	pl015,
//	pl016,
//	pl018,
//	pl013,
//	pl018,
//};




constexpr uint16 costumeFileIdsDante[MAX_COSTUME_DANTE] =
{
	pl000,
	pl011,
	pl013,
	pl015,
	pl016,
	pl018,
	pl013,
	pl018,
};

constexpr uint16 costumeFileIdsBob[MAX_COSTUME_BOB] =
{
	pl001,
};

constexpr uint16 costumeFileIdsLady[MAX_COSTUME_LADY] =
{
	pl002,
	em034,
};

constexpr uint16 costumeFileIdsVergil[MAX_COSTUME_VERGIL] =
{
	pl021,
	pl023,
	pl021,
	pl026,
	pl026,
};



constexpr uint16 devilFileIdsDante[6] =
{
	pl005,
	pl006,
	pl007,
	pl008,
	pl009,
	pl017,
};






constexpr uint8 weaponDevilIds[MAX_WEAPON] =
{
	DEVIL_REBELLION,
	DEVIL_CERBERUS,
	DEVIL_AGNI_RUDRA,
	DEVIL_NEVAN,
	DEVIL_BEOWULF,
	0,
	0,
	0,
	0,
	0,
	0,
	DEVIL_YAMATO,
	DEVIL_BEOWULF,
	DEVIL_YAMATO,
	DEVIL_YAMATO,
};







constexpr uint32 hudTopOffs[] =
{
	0x700,
	0xE80,
	0x1600,
	0x1D80,
	0x2500,
	0x2C80,
	0x3400,
	0x3B80,
	0x4300,
	0x4A80,
	0x5200,
	0x5980,
	0x6100,
};

constexpr uint32 hudBottomOffs[] =
{
	0x880,
	0x1000,
	0x1780,
	0x1F00,
};











//struct MODEL_FILE_HELPER
//{
//	struct Data
//	{
//		uint16 cacheFileId;
//		uint8  fileIndex;
//	};
//	Data model;
//	Data texture;
//	Data shadow;
//	Data physics;
//};
//
//typedef MODEL_FILE_HELPER DEVIL_MODEL_FILE_HELPER;





struct ModelPartitionData
{
	uint8 value;
	_(895);
};

static_assert(sizeof(ModelPartitionData) == 0x380);

struct ModelData
{
	_(8);
	byte8 ** functions;
	_(8);
	bool visible;
	bool physics;
	_(358);
	ModelPartitionData * modelPartitionData;
	_(888);
	struct
	{
		_(84);
		float32 duration1[2];
		_(56);
		float32 duration2[2];
		_(244);
		bool init;
		_(35);
		float32 timer[2];
		_(196);
	}
	Motion;
};

static_assert(offsetof(ModelData, functions) == 8);
static_assert(offsetof(ModelData, visible) == 0x18);
static_assert(offsetof(ModelData, physics) == 0x19);
static_assert(offsetof(ModelData, Motion) == 0x500);
static_assert(offsetof(ModelData, Motion.duration1) == 0x554);
static_assert(offsetof(ModelData, Motion.duration2) == 0x594);
static_assert(offsetof(ModelData, Motion.init) == 0x690);
static_assert(offsetof(ModelData, Motion.timer) == 0x6B4);
static_assert(sizeof(ModelData) == 0x780);






struct RecoveryData
{
	byte8 ** functions;
	_(24);
	bool init;
	_(15);
	vec4 data[4];
};

static_assert(offsetof(RecoveryData, init) == 0x20);
static_assert(offsetof(RecoveryData, data) == 0x30);
static_assert(sizeof(RecoveryData) == 0x70);














//struct SHADOW_DATA
//{
//	_(192);
//	operator byte8 *()
//	{
//		return reinterpret_cast<byte8 *>(this);
//	}
//};
//
//static_assert(sizeof(SHADOW_DATA) == 0xC0);
//
//struct PHYSICS_DATA
//{
//	_(240);
//	operator byte8 *()
//	{
//		return reinterpret_cast<byte8 *>(this);
//	}
//};
//
//static_assert(sizeof(PHYSICS_DATA) == 0xF0);


IntroduceSizeStruct(32);
IntroduceSizeStruct(112);
IntroduceSizeStruct(192);
IntroduceSizeStruct(240);
IntroduceSizeStruct(288);
IntroduceSizeStruct(768);



struct WeaponData
{
	_(274);
	uint8 weapon;
	_(5);
	uint8 value;
	_(7);
	byte8 * actorBaseAddr;
};

static_assert(offsetof(WeaponData, weapon) == 0x112);
static_assert(offsetof(WeaponData, value) == 0x118);
static_assert(offsetof(WeaponData, actorBaseAddr) == 0x120);



enum ACTOR_DATA_SIZE
{
	ACTOR_DATA_SIZE_DANTE  = 47296,
	ACTOR_DATA_SIZE_BOB    = 46720,
	ACTOR_DATA_SIZE_LADY   = 33408,
	ACTOR_DATA_SIZE_VERGIL = 47296,
};




struct PlayerData
{
	uint8 character;
	uint8 costume;
	bool forceFiles;
	uint8 forceFilesCharacter;
	uint8 style;
	uint8 meleeWeapons[MELEE_WEAPON_COUNT];
	uint8 meleeWeaponCount;
	uint8 meleeWeaponIndex;
	uint8 rangedWeapons[RANGED_WEAPON_COUNT];
	uint8 rangedWeaponCount;
	uint8 rangedWeaponIndex;
};



//constexpr uint64 playerDataSize = sizeof(PlayerData);





// $ActorDataStart

struct ActorData
{
	_(8);
	uint8 status; // 8
	_(111);
	uint32 character; // 0x78
	_(4);
	vec4 position; // 0x80
	_(4);
	float32 pull; // 0x94
	_(12);
	float32 pullMultiplier; // 0xA4
	_(24);
	uint16 rotation; // 0xC0
	_(86);
	uint8 id; // 0x118
	_(3);
	bool32 isClone; // 0x11C
	uint32 visible; // 0x120
	_(156);
	float32 var_1C0; // 0x1C0
	float32 var_1C4; // 0x1C4
	_(56);
	ModelData modelData[3]; // 0x200
	PhysicsMetadata * modelPhysicsMetadataPool[4][24]; // 0x1880
	uint32 modelAllocationDataCount; // 0x1B80
	_(4);
	Size_32 modelAllocationData[209]; // 0x1B88
	_(748);
	float32 motionSpeed; // 0x3894
	float32 motionSpeedMultiplier; // 0x3898
	_(4);
	byte8 * motionArchives[32]; // 0x38A0
	_(16);
	MotionData motionData[2]; // 0x39B0
	MotionData motionDataMirror[3]; // 0x39B4
	_(2);
	uint32 var_39BC; // 0x39BC
	uint8 var_39C0[16]; // 0x39C0
	uint32 nextActionRequestPolicy[16]; // 0x39D0
	uint8 var_3A10[8]; // 0x3A10
	uint32 shadow; // 0x3A18
	uint32 lastShadow; // 0x3A1C
	_(8);
	byte32 color; // 0x3A28
	_(212);
	RecoveryData recoveryData[3]; // 0x3B00
	byte8 var_3C50[2]; // 0x3C50
	_(382);
	byte8 * actionData[6]; // 0x3DD0
	ActorEventData eventData[2]; // 0x3E00
	uint8 var_3E10[32]; // 0x3E10
	_(4);
	float32 motionTimer; // 0x3E34
	float32 idleTimer; // 0x3E38
	_(36);
	byte32 permissions; // 0x3E60
	byte32 state; // 0x3E64
	byte32 lastState; // 0x3E68
	uint32 activeModelIndex; // 0x3E6C
	uint32 queuedModelIndex; // 0x3E70
	uint32 devilModels[3]; // 0x3E74
	uint8 modelState; // 0x3E80
	_(3);
	bool32 lockOn; // 0x3E84
	uint32 activeModelIndexMirror; // 0x3E88
	uint32 activeDevil; // 0x3E8C
	uint32 airRaid; // 0x3E90
	uint32 mode; // 0x3E94
	_(3);
	bool devil; // 0x3E9B
	_(2);
	uint8 costume; // 0x3E9E
	_(5);
	bool useHolyWater; // 0x3EA4
	_(19);
	float32 magicPoints; // 0x3EB8
	float32 maxMagicPoints; // 0x3EBC
	_(4);
	float32 var_3EC4; // 0x3EC4
	float32 var_3EC8; // 0x3EC8
	_(6);
	uint16 var_3ED2; // 0x3ED2
	_(4);
	uint16 cameraDirection; // 0x3ED8
	_(55);
	uint8 airHikeCount; // 0x3F11
	uint8 kickJumpCount; // 0x3F12
	uint8 wallHikeCount; // 0x3F13
	_(5);
	bool var_3F19; // 0x3F19
	_(138);
	uint8 action; // 0x3FA4
	uint8 lastAction; // 0x3FA5
	_(2);
	uint8 bufferedAction; // 0x3FA8
	_(3);
	uint8 chainCount; // 0x3FAC
	_(63);
	byte32 expertise[16]; // 0x3FEC
	_(192);
	float32 maxHitPoints; // 0x40EC
	_(44);
	float32 hitPoints; // 0x411C
	_(8712);
	byte8 * targetBaseAddr; // 0x6328
	_(8);
	uint32 style; // 0x6338
	_(4);
	uint32 var_6340; // 0x6340
	_(20);
	uint32 styleLevel; // 0x6358
	_(5);
	bool quicksilver; // 0x6361
	bool doppelganger; // 0x6362
	_(1);
	float32 styleExperience; // 0x6364
	_(168);
	byte8 var_6410[40]; // 0x6410
	byte8 * var_6438; // 0x6438
	uint32 var_6440; // 0x6440
	_(12);
	uint32 cloneRate; // 0x6450
	uint32 var_6454; // 0x6454
	byte8 var_6458[32]; // 0x6458
	byte8 * cloneBaseAddr; // 0x6478
	bool cloneIsControlledByPlayer; // 0x6480
	_(23);
	uint8 weapons[5]; // 0x6498
	_(3);
	WeaponData * weaponData[5]; // 0x64A0
	uint32 weaponStatus[5]; // 0x64C8
	uint32 weaponLevels[5]; // 0x64DC
	_(4);
	float32 weaponTimers[5]; // 0x64F4
	float32 meleeWeaponSwitchTimeout; // 0x6508
	float32 rangedWeaponSwitchTimeout; // 0x650C
	uint32 styleRank; // 0x6510
	float32 styleMeter; // 0x6514
	_(348);
	InputData inputData[58]; // 0x6674
	_(36);
	BodyPartData bodyPartData[3][2]; // 0x6950
	_(576);
	byte8 var_7250[4]; // 0x7250
	uint32 collisionIndex; // 0x7254
	_(520);
	vec4 interactionData[8]; // 0x7460
	byte16 buttons[4]; // 0x74E0
	_(16);
	uint16 rightStickPosition; // 0x74F8
	uint16 rightStickRadius; // 0x74FA
	_(12);
	uint16 leftStickPosition; // 0x7508
	uint16 leftStickRadius; // 0x750A
	uint16 actorCameraDirection; // 0x750C
	_(14);
	uint32 leftStickDirection[2]; // 0x751C
	_(28);
	ModelData submodelData[5]; // 0x7540
	bool submodelInit[5]; // 0x9AC0
	_(7675);
	uint32 newFirstVar; // 0xB8C0
	_(12);
	ModelData newModelData[6]; // 0xB8D0
	PhysicsMetadata * newModelPhysicsMetadataPool[7][24]; // 0xE5D0
	Size_32 newModelAllocationData[512]; // 0xEB10
	RecoveryData newRecoveryData[6]; // 0x12B10
	uint32 newDevilModels[6]; // 0x12DB0
	_(8);
	BodyPartData newBodyPartData[7][2]; // 0x12DD0
	ModelData newSubmodelData[11]; // 0x13D90
	bool newSubmodelInit[11]; // 0x19010
	_(5);
	ShadowData newModelShadowData[6]; // 0x19020
	ShadowData newSubmodelShadowData[11]; // 0x194A0
	PhysicsMetadata * newDevilModelPhysicsMetadataPool[5][36]; // 0x19CE0
	PhysicsData newDevilSubmodelPhysicsData[10]; // 0x1A280
	PhysicsLinkData newDevilSubmodelPhysicsLinkData[10][4]; // 0x1ABE0
	uint8 newWeapons[10]; // 0x1C9E0
	_(6);
	WeaponData * newWeaponData[10]; // 0x1C9F0
	uint32 newWeaponStatus[10]; // 0x1CA40
	_(8);
	uint32 newWeaponLevels[10]; // 0x1CA70
	_(8);
	float32 newWeaponTimers[10]; // 0x1CAA0
	bool32 newIsClone; // 0x1CAC8
	uint8 newPlayer; // 0x1CACC
	uint8 newEntity; // 0x1CACD
	bool newForceFiles; // 0x1CACE
	uint8 newForceFilesCharacter; // 0x1CACF
	uint8 newGamepad; // 0x1CAD0
	byte16 newButtonMask; // 0x1CAD1
	bool newEnableRightStick; // 0x1CAD3
	bool newEnableLeftStick; // 0x1CAD4
	bool newExecuteStyleSwitch; // 0x1CAD5
	bool newEnable; // 0x1CAD6
	uint8 newAirStingerCount; // 0x1CAD7
	_(8);
	byte32 newEffectIndices[8]; // 0x1CAE0
	uint32 newLastVar; // 0x1CB00

	operator byte8 *()
	{
		return reinterpret_cast<byte8 *>(this);
	}
};

struct ActorDataDante
{
	_(8);
	uint8 status; // 8
	_(111);
	uint32 character; // 0x78
	_(4);
	vec4 position; // 0x80
	_(4);
	float32 pull; // 0x94
	_(12);
	float32 pullMultiplier; // 0xA4
	_(24);
	uint16 rotation; // 0xC0
	_(86);
	uint8 id; // 0x118
	_(3);
	bool32 isClone; // 0x11C
	uint32 visible; // 0x120
	_(156);
	float32 var_1C0; // 0x1C0
	float32 var_1C4; // 0x1C4
	_(56);
	ModelData modelData[3]; // 0x200
	PhysicsMetadata * modelPhysicsMetadataPool[4][24]; // 0x1880
	uint32 modelAllocationDataCount; // 0x1B80
	_(4);
	Size_32 modelAllocationData[209]; // 0x1B88
	_(748);
	float32 motionSpeed; // 0x3894
	float32 motionSpeedMultiplier; // 0x3898
	_(4);
	byte8 * motionArchives[32]; // 0x38A0
	_(16);
	MotionData motionData[2]; // 0x39B0
	MotionData motionDataMirror[3]; // 0x39B4
	_(2);
	uint32 var_39BC; // 0x39BC
	uint8 var_39C0[16]; // 0x39C0
	uint32 nextActionRequestPolicy[16]; // 0x39D0
	uint8 var_3A10[8]; // 0x3A10
	uint32 shadow; // 0x3A18
	uint32 lastShadow; // 0x3A1C
	_(8);
	byte32 color; // 0x3A28
	_(212);
	RecoveryData recoveryData[3]; // 0x3B00
	byte8 var_3C50[2]; // 0x3C50
	_(382);
	byte8 * actionData[6]; // 0x3DD0
	ActorEventData eventData[2]; // 0x3E00
	uint8 var_3E10[32]; // 0x3E10
	_(4);
	float32 motionTimer; // 0x3E34
	float32 idleTimer; // 0x3E38
	_(36);
	byte32 permissions; // 0x3E60
	byte32 state; // 0x3E64
	byte32 lastState; // 0x3E68
	uint32 activeModelIndex; // 0x3E6C
	uint32 queuedModelIndex; // 0x3E70
	uint32 devilModels[3]; // 0x3E74
	uint8 modelState; // 0x3E80
	_(3);
	bool32 lockOn; // 0x3E84
	uint32 activeModelIndexMirror; // 0x3E88
	uint32 activeDevil; // 0x3E8C
	uint32 airRaid; // 0x3E90
	uint32 mode; // 0x3E94
	_(3);
	bool devil; // 0x3E9B
	_(2);
	uint8 costume; // 0x3E9E
	bool sparda; // 0x3E9F
	_(4);
	bool useHolyWater; // 0x3EA4
	_(19);
	float32 magicPoints; // 0x3EB8
	float32 maxMagicPoints; // 0x3EBC
	_(4);
	float32 var_3EC4; // 0x3EC4
	float32 var_3EC8; // 0x3EC8
	_(6);
	uint16 var_3ED2; // 0x3ED2
	_(4);
	uint16 cameraDirection; // 0x3ED8
	_(55);
	uint8 airHikeCount; // 0x3F11
	uint8 kickJumpCount; // 0x3F12
	uint8 wallHikeCount; // 0x3F13
	_(5);
	bool var_3F19; // 0x3F19
	_(138);
	uint8 action; // 0x3FA4
	uint8 lastAction; // 0x3FA5
	_(2);
	uint8 bufferedAction; // 0x3FA8
	_(3);
	uint8 chainCount; // 0x3FAC
	_(63);
	byte32 expertise[16]; // 0x3FEC
	_(192);
	float32 maxHitPoints; // 0x40EC
	_(44);
	float32 hitPoints; // 0x411C
	_(8712);
	byte8 * targetBaseAddr; // 0x6328
	_(8);
	uint32 style; // 0x6338
	_(4);
	uint32 var_6340; // 0x6340
	_(20);
	uint32 styleLevel; // 0x6358
	uint8 dashCount; // 0x635C
	uint8 skyStarCount; // 0x635D
	uint8 airTrickCount; // 0x635E
	_(2);
	bool quicksilver; // 0x6361
	bool doppelganger; // 0x6362
	_(1);
	float32 styleExperience; // 0x6364
	_(168);
	byte8 var_6410[40]; // 0x6410
	byte8 * var_6438; // 0x6438
	uint32 var_6440; // 0x6440
	_(12);
	uint32 cloneRate; // 0x6450
	uint32 var_6454; // 0x6454
	byte8 var_6458[32]; // 0x6458
	byte8 * cloneBaseAddr; // 0x6478
	bool cloneIsControlledByPlayer; // 0x6480
	_(12);
	uint8 activeWeapon; // 0x648D
	_(2);
	uint32 meleeWeaponIndex; // 0x6490
	uint32 rangedWeaponIndex; // 0x6494
	uint8 weapons[5]; // 0x6498
	_(3);
	WeaponData * weaponData[5]; // 0x64A0
	uint32 weaponStatus[5]; // 0x64C8
	uint32 weaponLevels[5]; // 0x64DC
	uint8 activeMeleeWeapon; // 0x64F0
	uint8 activeRangedWeapon; // 0x64F1
	_(2);
	float32 weaponTimers[5]; // 0x64F4
	float32 meleeWeaponSwitchTimeout; // 0x6508
	float32 rangedWeaponSwitchTimeout; // 0x650C
	uint32 styleRank; // 0x6510
	float32 styleMeter; // 0x6514
	_(348);
	InputData inputData[58]; // 0x6674
	_(36);
	BodyPartData bodyPartData[3][2]; // 0x6950
	_(576);
	byte8 var_7250[4]; // 0x7250
	uint32 collisionIndex; // 0x7254
	_(520);
	vec4 interactionData[8]; // 0x7460
	byte16 buttons[4]; // 0x74E0
	_(16);
	uint16 rightStickPosition; // 0x74F8
	uint16 rightStickRadius; // 0x74FA
	_(12);
	uint16 leftStickPosition; // 0x7508
	uint16 leftStickRadius; // 0x750A
	uint16 actorCameraDirection; // 0x750C
	_(14);
	uint32 leftStickDirection[2]; // 0x751C
	_(28);
	ModelData submodelData[5]; // 0x7540
	bool submodelInit[5]; // 0x9AC0
	_(11);
	ShadowData modelShadowData[3]; // 0x9AD0
	ShadowData submodelShadowData[5]; // 0x9D10
	PhysicsMetadata * submodelPhysicsMetadataPool[39]; // 0xA0D0
	_(8);
	PhysicsData submodelPhysicsData; // 0xA210
	PhysicsMetadata * devilModelPhysicsMetadataPool[2][36]; // 0xA300
	PhysicsData devilSubmodelPhysicsData[4]; // 0xA540
	_(256);
	PhysicsLinkData devilSubmodelPhysicsLinkData[4][4]; // 0xAA00
	DevilModelMetadataDante devilModelMetadata; // 0xB600
	_(15);
	ModelMetadata modelMetadata[6]; // 0xB630
	_(88);
	float32 artemisChargeValue[2]; // 0xB868
	_(12);
	byte32 artemisChargeFlags[2]; // 0xB87C
	_(60);
	uint32 newFirstVar; // 0xB8C0
	_(12);
	ModelData newModelData[6]; // 0xB8D0
	PhysicsMetadata * newModelPhysicsMetadataPool[7][24]; // 0xE5D0
	Size_32 newModelAllocationData[512]; // 0xEB10
	RecoveryData newRecoveryData[6]; // 0x12B10
	uint32 newDevilModels[6]; // 0x12DB0
	_(8);
	BodyPartData newBodyPartData[7][2]; // 0x12DD0
	ModelData newSubmodelData[11]; // 0x13D90
	bool newSubmodelInit[11]; // 0x19010
	_(5);
	ShadowData newModelShadowData[6]; // 0x19020
	ShadowData newSubmodelShadowData[11]; // 0x194A0
	PhysicsMetadata * newDevilModelPhysicsMetadataPool[5][36]; // 0x19CE0
	PhysicsData newDevilSubmodelPhysicsData[10]; // 0x1A280
	PhysicsLinkData newDevilSubmodelPhysicsLinkData[10][4]; // 0x1ABE0
	uint8 newWeapons[10]; // 0x1C9E0
	_(6);
	WeaponData * newWeaponData[10]; // 0x1C9F0
	uint32 newWeaponStatus[10]; // 0x1CA40
	_(8);
	uint32 newWeaponLevels[10]; // 0x1CA70
	_(8);
	float32 newWeaponTimers[10]; // 0x1CAA0
	bool32 newIsClone; // 0x1CAC8
	uint8 newPlayer; // 0x1CACC
	uint8 newEntity; // 0x1CACD
	bool newForceFiles; // 0x1CACE
	uint8 newForceFilesCharacter; // 0x1CACF
	uint8 newGamepad; // 0x1CAD0
	byte16 newButtonMask; // 0x1CAD1
	bool newEnableRightStick; // 0x1CAD3
	bool newEnableLeftStick; // 0x1CAD4
	bool newExecuteStyleSwitch; // 0x1CAD5
	bool newEnable; // 0x1CAD6
	uint8 newAirStingerCount; // 0x1CAD7
	_(8);
	byte32 newEffectIndices[8]; // 0x1CAE0
	uint32 newLastVar; // 0x1CB00

	operator byte8 *()
	{
		return reinterpret_cast<byte8 *>(this);
	}
};

struct ActorDataBob
{
	_(8);
	uint8 status; // 8
	_(111);
	uint32 character; // 0x78
	_(4);
	vec4 position; // 0x80
	_(4);
	float32 pull; // 0x94
	_(12);
	float32 pullMultiplier; // 0xA4
	_(24);
	uint16 rotation; // 0xC0
	_(86);
	uint8 id; // 0x118
	_(3);
	bool32 isClone; // 0x11C
	uint32 visible; // 0x120
	_(156);
	float32 var_1C0; // 0x1C0
	float32 var_1C4; // 0x1C4
	_(56);
	ModelData modelData[3]; // 0x200
	PhysicsMetadata * modelPhysicsMetadataPool[4][24]; // 0x1880
	uint32 modelAllocationDataCount; // 0x1B80
	_(4);
	Size_32 modelAllocationData[209]; // 0x1B88
	_(748);
	float32 motionSpeed; // 0x3894
	float32 motionSpeedMultiplier; // 0x3898
	_(4);
	byte8 * motionArchives[32]; // 0x38A0
	_(16);
	MotionData motionData[2]; // 0x39B0
	MotionData motionDataMirror[3]; // 0x39B4
	_(2);
	uint32 var_39BC; // 0x39BC
	uint8 var_39C0[16]; // 0x39C0
	uint32 nextActionRequestPolicy[16]; // 0x39D0
	uint8 var_3A10[8]; // 0x3A10
	uint32 shadow; // 0x3A18
	uint32 lastShadow; // 0x3A1C
	_(8);
	byte32 color; // 0x3A28
	_(212);
	RecoveryData recoveryData[3]; // 0x3B00
	byte8 var_3C50[2]; // 0x3C50
	_(382);
	byte8 * actionData[6]; // 0x3DD0
	ActorEventData eventData[2]; // 0x3E00
	uint8 var_3E10[32]; // 0x3E10
	_(4);
	float32 motionTimer; // 0x3E34
	float32 idleTimer; // 0x3E38
	_(36);
	byte32 permissions; // 0x3E60
	byte32 state; // 0x3E64
	byte32 lastState; // 0x3E68
	uint32 activeModelIndex; // 0x3E6C
	uint32 queuedModelIndex; // 0x3E70
	uint32 devilModels[3]; // 0x3E74
	uint8 modelState; // 0x3E80
	_(3);
	bool32 lockOn; // 0x3E84
	uint32 activeModelIndexMirror; // 0x3E88
	uint32 activeDevil; // 0x3E8C
	uint32 airRaid; // 0x3E90
	uint32 mode; // 0x3E94
	_(3);
	bool devil; // 0x3E9B
	_(2);
	uint8 costume; // 0x3E9E
	_(5);
	bool useHolyWater; // 0x3EA4
	_(19);
	float32 magicPoints; // 0x3EB8
	float32 maxMagicPoints; // 0x3EBC
	_(4);
	float32 var_3EC4; // 0x3EC4
	float32 var_3EC8; // 0x3EC8
	_(6);
	uint16 var_3ED2; // 0x3ED2
	_(4);
	uint16 cameraDirection; // 0x3ED8
	_(55);
	uint8 airHikeCount; // 0x3F11
	uint8 kickJumpCount; // 0x3F12
	uint8 wallHikeCount; // 0x3F13
	_(5);
	bool var_3F19; // 0x3F19
	_(138);
	uint8 action; // 0x3FA4
	uint8 lastAction; // 0x3FA5
	_(2);
	uint8 bufferedAction; // 0x3FA8
	_(3);
	uint8 chainCount; // 0x3FAC
	_(63);
	byte32 expertise[16]; // 0x3FEC
	_(192);
	float32 maxHitPoints; // 0x40EC
	_(44);
	float32 hitPoints; // 0x411C
	_(8712);
	byte8 * targetBaseAddr; // 0x6328
	_(8);
	uint32 style; // 0x6338
	_(4);
	uint32 var_6340; // 0x6340
	_(20);
	uint32 styleLevel; // 0x6358
	_(5);
	bool quicksilver; // 0x6361
	bool doppelganger; // 0x6362
	_(1);
	float32 styleExperience; // 0x6364
	_(168);
	byte8 var_6410[40]; // 0x6410
	byte8 * var_6438; // 0x6438
	uint32 var_6440; // 0x6440
	_(12);
	uint32 cloneRate; // 0x6450
	uint32 var_6454; // 0x6454
	byte8 var_6458[32]; // 0x6458
	byte8 * cloneBaseAddr; // 0x6478
	bool cloneIsControlledByPlayer; // 0x6480
	_(23);
	uint8 weapons[5]; // 0x6498
	_(3);
	WeaponData * weaponData[5]; // 0x64A0
	uint32 weaponStatus[5]; // 0x64C8
	uint32 weaponLevels[5]; // 0x64DC
	_(4);
	float32 weaponTimers[5]; // 0x64F4
	float32 meleeWeaponSwitchTimeout; // 0x6508
	float32 rangedWeaponSwitchTimeout; // 0x650C
	uint32 styleRank; // 0x6510
	float32 styleMeter; // 0x6514
	_(348);
	InputData inputData[58]; // 0x6674
	_(36);
	BodyPartData bodyPartData[3][2]; // 0x6950
	_(576);
	byte8 var_7250[4]; // 0x7250
	uint32 collisionIndex; // 0x7254
	_(520);
	vec4 interactionData[8]; // 0x7460
	byte16 buttons[4]; // 0x74E0
	_(16);
	uint16 rightStickPosition; // 0x74F8
	uint16 rightStickRadius; // 0x74FA
	_(12);
	uint16 leftStickPosition; // 0x7508
	uint16 leftStickRadius; // 0x750A
	uint16 actorCameraDirection; // 0x750C
	_(14);
	uint32 leftStickDirection[2]; // 0x751C
	_(28);
	ModelData submodelData[5]; // 0x7540
	bool submodelInit[5]; // 0x9AC0
	_(7675);
	uint32 newFirstVar; // 0xB8C0
	_(12);
	ModelData newModelData[6]; // 0xB8D0
	PhysicsMetadata * newModelPhysicsMetadataPool[7][24]; // 0xE5D0
	Size_32 newModelAllocationData[512]; // 0xEB10
	RecoveryData newRecoveryData[6]; // 0x12B10
	uint32 newDevilModels[6]; // 0x12DB0
	_(8);
	BodyPartData newBodyPartData[7][2]; // 0x12DD0
	ModelData newSubmodelData[11]; // 0x13D90
	bool newSubmodelInit[11]; // 0x19010
	_(5);
	ShadowData newModelShadowData[6]; // 0x19020
	ShadowData newSubmodelShadowData[11]; // 0x194A0
	PhysicsMetadata * newDevilModelPhysicsMetadataPool[5][36]; // 0x19CE0
	PhysicsData newDevilSubmodelPhysicsData[10]; // 0x1A280
	PhysicsLinkData newDevilSubmodelPhysicsLinkData[10][4]; // 0x1ABE0
	uint8 newWeapons[10]; // 0x1C9E0
	_(6);
	WeaponData * newWeaponData[10]; // 0x1C9F0
	uint32 newWeaponStatus[10]; // 0x1CA40
	_(8);
	uint32 newWeaponLevels[10]; // 0x1CA70
	_(8);
	float32 newWeaponTimers[10]; // 0x1CAA0
	bool32 newIsClone; // 0x1CAC8
	uint8 newPlayer; // 0x1CACC
	uint8 newEntity; // 0x1CACD
	bool newForceFiles; // 0x1CACE
	uint8 newForceFilesCharacter; // 0x1CACF
	uint8 newGamepad; // 0x1CAD0
	byte16 newButtonMask; // 0x1CAD1
	bool newEnableRightStick; // 0x1CAD3
	bool newEnableLeftStick; // 0x1CAD4
	bool newExecuteStyleSwitch; // 0x1CAD5
	bool newEnable; // 0x1CAD6
	uint8 newAirStingerCount; // 0x1CAD7
	_(8);
	byte32 newEffectIndices[8]; // 0x1CAE0
	uint32 newLastVar; // 0x1CB00

	operator byte8 *()
	{
		return reinterpret_cast<byte8 *>(this);
	}
};

struct ActorDataLady
{
	_(8);
	uint8 status; // 8
	_(111);
	uint32 character; // 0x78
	_(4);
	vec4 position; // 0x80
	_(4);
	float32 pull; // 0x94
	_(12);
	float32 pullMultiplier; // 0xA4
	_(24);
	uint16 rotation; // 0xC0
	_(86);
	uint8 id; // 0x118
	_(3);
	bool32 isClone; // 0x11C
	uint32 visible; // 0x120
	_(156);
	float32 var_1C0; // 0x1C0
	float32 var_1C4; // 0x1C4
	_(56);
	ModelData modelData[3]; // 0x200
	PhysicsMetadata * modelPhysicsMetadataPool[4][24]; // 0x1880
	uint32 modelAllocationDataCount; // 0x1B80
	_(4);
	Size_32 modelAllocationData[209]; // 0x1B88
	_(748);
	float32 motionSpeed; // 0x3894
	float32 motionSpeedMultiplier; // 0x3898
	_(4);
	byte8 * motionArchives[32]; // 0x38A0
	_(16);
	MotionData motionData[2]; // 0x39B0
	MotionData motionDataMirror[3]; // 0x39B4
	_(2);
	uint32 var_39BC; // 0x39BC
	uint8 var_39C0[16]; // 0x39C0
	uint32 nextActionRequestPolicy[16]; // 0x39D0
	uint8 var_3A10[8]; // 0x3A10
	uint32 shadow; // 0x3A18
	uint32 lastShadow; // 0x3A1C
	_(8);
	byte32 color; // 0x3A28
	_(212);
	RecoveryData recoveryData[3]; // 0x3B00
	byte8 var_3C50[2]; // 0x3C50
	_(382);
	byte8 * actionData[6]; // 0x3DD0
	ActorEventData eventData[2]; // 0x3E00
	uint8 var_3E10[32]; // 0x3E10
	_(4);
	float32 motionTimer; // 0x3E34
	float32 idleTimer; // 0x3E38
	_(36);
	byte32 permissions; // 0x3E60
	byte32 state; // 0x3E64
	byte32 lastState; // 0x3E68
	uint32 activeModelIndex; // 0x3E6C
	uint32 queuedModelIndex; // 0x3E70
	uint32 devilModels[3]; // 0x3E74
	uint8 modelState; // 0x3E80
	_(3);
	bool32 lockOn; // 0x3E84
	uint32 activeModelIndexMirror; // 0x3E88
	uint32 activeDevil; // 0x3E8C
	uint32 airRaid; // 0x3E90
	uint32 mode; // 0x3E94
	_(3);
	bool devil; // 0x3E9B
	_(2);
	uint8 costume; // 0x3E9E
	_(5);
	bool useHolyWater; // 0x3EA4
	_(19);
	float32 magicPoints; // 0x3EB8
	float32 maxMagicPoints; // 0x3EBC
	_(4);
	float32 var_3EC4; // 0x3EC4
	float32 var_3EC8; // 0x3EC8
	_(6);
	uint16 var_3ED2; // 0x3ED2
	_(4);
	uint16 cameraDirection; // 0x3ED8
	_(55);
	uint8 airHikeCount; // 0x3F11
	uint8 kickJumpCount; // 0x3F12
	uint8 wallHikeCount; // 0x3F13
	_(5);
	bool var_3F19; // 0x3F19
	_(138);
	uint8 action; // 0x3FA4
	uint8 lastAction; // 0x3FA5
	_(2);
	uint8 bufferedAction; // 0x3FA8
	_(3);
	uint8 chainCount; // 0x3FAC
	_(63);
	byte32 expertise[16]; // 0x3FEC
	_(192);
	float32 maxHitPoints; // 0x40EC
	_(44);
	float32 hitPoints; // 0x411C
	_(8712);
	byte8 * targetBaseAddr; // 0x6328
	_(8);
	uint32 style; // 0x6338
	_(4);
	uint32 var_6340; // 0x6340
	_(20);
	uint32 styleLevel; // 0x6358
	_(5);
	bool quicksilver; // 0x6361
	bool doppelganger; // 0x6362
	_(1);
	float32 styleExperience; // 0x6364
	_(168);
	byte8 var_6410[40]; // 0x6410
	byte8 * var_6438; // 0x6438
	uint32 var_6440; // 0x6440
	_(12);
	uint32 cloneRate; // 0x6450
	uint32 var_6454; // 0x6454
	byte8 var_6458[32]; // 0x6458
	byte8 * cloneBaseAddr; // 0x6478
	bool cloneIsControlledByPlayer; // 0x6480
	_(23);
	uint8 weapons[5]; // 0x6498
	_(3);
	WeaponData * weaponData[5]; // 0x64A0
	uint32 weaponStatus[5]; // 0x64C8
	uint32 weaponLevels[5]; // 0x64DC
	_(4);
	float32 weaponTimers[5]; // 0x64F4
	float32 meleeWeaponSwitchTimeout; // 0x6508
	float32 rangedWeaponSwitchTimeout; // 0x650C
	uint32 styleRank; // 0x6510
	float32 styleMeter; // 0x6514
	_(348);
	InputData inputData[58]; // 0x6674
	_(36);
	BodyPartData bodyPartData[3][2]; // 0x6950
	_(576);
	byte8 var_7250[4]; // 0x7250
	uint32 collisionIndex; // 0x7254
	_(520);
	vec4 interactionData[8]; // 0x7460
	byte16 buttons[4]; // 0x74E0
	_(16);
	uint16 rightStickPosition; // 0x74F8
	uint16 rightStickRadius; // 0x74FA
	_(12);
	uint16 leftStickPosition; // 0x7508
	uint16 leftStickRadius; // 0x750A
	uint16 actorCameraDirection; // 0x750C
	_(14);
	uint32 leftStickDirection[2]; // 0x751C
	_(28);
	ModelData submodelData[5]; // 0x7540
	bool submodelInit[5]; // 0x9AC0
	_(7675);
	uint32 newFirstVar; // 0xB8C0
	_(12);
	ModelData newModelData[6]; // 0xB8D0
	PhysicsMetadata * newModelPhysicsMetadataPool[7][24]; // 0xE5D0
	Size_32 newModelAllocationData[512]; // 0xEB10
	RecoveryData newRecoveryData[6]; // 0x12B10
	uint32 newDevilModels[6]; // 0x12DB0
	_(8);
	BodyPartData newBodyPartData[7][2]; // 0x12DD0
	ModelData newSubmodelData[11]; // 0x13D90
	bool newSubmodelInit[11]; // 0x19010
	_(5);
	ShadowData newModelShadowData[6]; // 0x19020
	ShadowData newSubmodelShadowData[11]; // 0x194A0
	PhysicsMetadata * newDevilModelPhysicsMetadataPool[5][36]; // 0x19CE0
	PhysicsData newDevilSubmodelPhysicsData[10]; // 0x1A280
	PhysicsLinkData newDevilSubmodelPhysicsLinkData[10][4]; // 0x1ABE0
	uint8 newWeapons[10]; // 0x1C9E0
	_(6);
	WeaponData * newWeaponData[10]; // 0x1C9F0
	uint32 newWeaponStatus[10]; // 0x1CA40
	_(8);
	uint32 newWeaponLevels[10]; // 0x1CA70
	_(8);
	float32 newWeaponTimers[10]; // 0x1CAA0
	bool32 newIsClone; // 0x1CAC8
	uint8 newPlayer; // 0x1CACC
	uint8 newEntity; // 0x1CACD
	bool newForceFiles; // 0x1CACE
	uint8 newForceFilesCharacter; // 0x1CACF
	uint8 newGamepad; // 0x1CAD0
	byte16 newButtonMask; // 0x1CAD1
	bool newEnableRightStick; // 0x1CAD3
	bool newEnableLeftStick; // 0x1CAD4
	bool newExecuteStyleSwitch; // 0x1CAD5
	bool newEnable; // 0x1CAD6
	uint8 newAirStingerCount; // 0x1CAD7
	_(8);
	byte32 newEffectIndices[8]; // 0x1CAE0
	uint32 newLastVar; // 0x1CB00

	operator byte8 *()
	{
		return reinterpret_cast<byte8 *>(this);
	}
};

struct ActorDataVergil
{
	_(8);
	uint8 status; // 8
	_(111);
	uint32 character; // 0x78
	_(4);
	vec4 position; // 0x80
	_(4);
	float32 pull; // 0x94
	_(12);
	float32 pullMultiplier; // 0xA4
	_(24);
	uint16 rotation; // 0xC0
	_(86);
	uint8 id; // 0x118
	_(3);
	bool32 isClone; // 0x11C
	uint32 visible; // 0x120
	_(156);
	float32 var_1C0; // 0x1C0
	float32 var_1C4; // 0x1C4
	_(56);
	ModelData modelData[3]; // 0x200
	PhysicsMetadata * modelPhysicsMetadataPool[4][24]; // 0x1880
	uint32 modelAllocationDataCount; // 0x1B80
	_(4);
	Size_32 modelAllocationData[209]; // 0x1B88
	_(748);
	float32 motionSpeed; // 0x3894
	float32 motionSpeedMultiplier; // 0x3898
	_(4);
	byte8 * motionArchives[32]; // 0x38A0
	_(16);
	MotionData motionData[2]; // 0x39B0
	MotionData motionDataMirror[3]; // 0x39B4
	_(2);
	uint32 var_39BC; // 0x39BC
	uint8 var_39C0[16]; // 0x39C0
	uint32 nextActionRequestPolicy[16]; // 0x39D0
	uint8 var_3A10[8]; // 0x3A10
	uint32 shadow; // 0x3A18
	uint32 lastShadow; // 0x3A1C
	_(8);
	byte32 color; // 0x3A28
	_(212);
	RecoveryData recoveryData[3]; // 0x3B00
	byte8 var_3C50[2]; // 0x3C50
	_(382);
	byte8 * actionData[6]; // 0x3DD0
	ActorEventData eventData[2]; // 0x3E00
	uint8 var_3E10[32]; // 0x3E10
	_(4);
	float32 motionTimer; // 0x3E34
	float32 idleTimer; // 0x3E38
	_(36);
	byte32 permissions; // 0x3E60
	byte32 state; // 0x3E64
	byte32 lastState; // 0x3E68
	uint32 activeModelIndex; // 0x3E6C
	uint32 queuedModelIndex; // 0x3E70
	uint32 devilModels[3]; // 0x3E74
	uint8 modelState; // 0x3E80
	_(3);
	bool32 lockOn; // 0x3E84
	uint32 activeModelIndexMirror; // 0x3E88
	uint32 activeDevil; // 0x3E8C
	uint32 airRaid; // 0x3E90
	uint32 mode; // 0x3E94
	_(3);
	bool devil; // 0x3E9B
	_(2);
	uint8 costume; // 0x3E9E
	bool neroAngelo; // 0x3E9F
	_(4);
	bool useHolyWater; // 0x3EA4
	_(19);
	float32 magicPoints; // 0x3EB8
	float32 maxMagicPoints; // 0x3EBC
	_(4);
	float32 var_3EC4; // 0x3EC4
	float32 var_3EC8; // 0x3EC8
	_(6);
	uint16 var_3ED2; // 0x3ED2
	_(4);
	uint16 cameraDirection; // 0x3ED8
	_(55);
	uint8 airHikeCount; // 0x3F11
	uint8 kickJumpCount; // 0x3F12
	uint8 wallHikeCount; // 0x3F13
	_(5);
	bool var_3F19; // 0x3F19
	_(138);
	uint8 action; // 0x3FA4
	uint8 lastAction; // 0x3FA5
	_(2);
	uint8 bufferedAction; // 0x3FA8
	_(3);
	uint8 chainCount; // 0x3FAC
	_(63);
	byte32 expertise[16]; // 0x3FEC
	_(192);
	float32 maxHitPoints; // 0x40EC
	_(44);
	float32 hitPoints; // 0x411C
	_(8712);
	byte8 * targetBaseAddr; // 0x6328
	_(8);
	uint32 style; // 0x6338
	_(4);
	uint32 var_6340; // 0x6340
	_(20);
	uint32 styleLevel; // 0x6358
	_(2);
	uint8 airTrickCount; // 0x635E
	uint8 trickUpCount; // 0x635F
	uint8 trickDownCount; // 0x6360
	bool quicksilver; // 0x6361
	bool doppelganger; // 0x6362
	_(1);
	float32 styleExperience; // 0x6364
	_(168);
	byte8 var_6410[40]; // 0x6410
	byte8 * var_6438; // 0x6438
	uint32 var_6440; // 0x6440
	_(12);
	uint32 cloneRate; // 0x6450
	uint32 var_6454; // 0x6454
	byte8 var_6458[32]; // 0x6458
	byte8 * cloneBaseAddr; // 0x6478
	bool cloneIsControlledByPlayer; // 0x6480
	_(3);
	uint32 activeMeleeWeaponIndex; // 0x6484
	uint32 queuedMeleeWeaponIndex; // 0x6488
	_(12);
	uint8 weapons[5]; // 0x6498
	_(3);
	WeaponData * weaponData[5]; // 0x64A0
	uint32 weaponStatus[5]; // 0x64C8
	uint32 weaponLevels[5]; // 0x64DC
	_(4);
	float32 weaponTimers[5]; // 0x64F4
	float32 meleeWeaponSwitchTimeout; // 0x6508
	float32 rangedWeaponSwitchTimeout; // 0x650C
	uint32 styleRank; // 0x6510
	float32 styleMeter; // 0x6514
	_(348);
	InputData inputData[58]; // 0x6674
	_(36);
	BodyPartData bodyPartData[3][2]; // 0x6950
	_(576);
	byte8 var_7250[4]; // 0x7250
	uint32 collisionIndex; // 0x7254
	_(520);
	vec4 interactionData[8]; // 0x7460
	byte16 buttons[4]; // 0x74E0
	_(16);
	uint16 rightStickPosition; // 0x74F8
	uint16 rightStickRadius; // 0x74FA
	_(12);
	uint16 leftStickPosition; // 0x7508
	uint16 leftStickRadius; // 0x750A
	uint16 actorCameraDirection; // 0x750C
	_(14);
	uint32 leftStickDirection[2]; // 0x751C
	_(28);
	ModelData submodelData[5]; // 0x7540
	bool submodelInit[5]; // 0x9AC0
	_(43);
	ShadowData modelShadowData[3]; // 0x9AF0
	ShadowData submodelShadowData[5]; // 0x9D30
	PhysicsMetadata * submodelPhysicsMetadataPool[39]; // 0xA0F0
	_(8);
	PhysicsData submodelPhysicsData; // 0xA230
	_(4896);
	ModelMetadata modelMetadata[6]; // 0xB640
	_(160);
	uint32 newFirstVar; // 0xB8C0
	_(12);
	ModelData newModelData[6]; // 0xB8D0
	PhysicsMetadata * newModelPhysicsMetadataPool[7][24]; // 0xE5D0
	Size_32 newModelAllocationData[512]; // 0xEB10
	RecoveryData newRecoveryData[6]; // 0x12B10
	uint32 newDevilModels[6]; // 0x12DB0
	_(8);
	BodyPartData newBodyPartData[7][2]; // 0x12DD0
	ModelData newSubmodelData[11]; // 0x13D90
	bool newSubmodelInit[11]; // 0x19010
	_(5);
	ShadowData newModelShadowData[6]; // 0x19020
	ShadowData newSubmodelShadowData[11]; // 0x194A0
	PhysicsMetadata * newDevilModelPhysicsMetadataPool[5][36]; // 0x19CE0
	PhysicsData newDevilSubmodelPhysicsData[10]; // 0x1A280
	PhysicsLinkData newDevilSubmodelPhysicsLinkData[10][4]; // 0x1ABE0
	uint8 newWeapons[10]; // 0x1C9E0
	_(6);
	WeaponData * newWeaponData[10]; // 0x1C9F0
	uint32 newWeaponStatus[10]; // 0x1CA40
	_(8);
	uint32 newWeaponLevels[10]; // 0x1CA70
	_(8);
	float32 newWeaponTimers[10]; // 0x1CAA0
	bool32 newIsClone; // 0x1CAC8
	uint8 newPlayer; // 0x1CACC
	uint8 newEntity; // 0x1CACD
	bool newForceFiles; // 0x1CACE
	uint8 newForceFilesCharacter; // 0x1CACF
	uint8 newGamepad; // 0x1CAD0
	byte16 newButtonMask; // 0x1CAD1
	bool newEnableRightStick; // 0x1CAD3
	bool newEnableLeftStick; // 0x1CAD4
	bool newExecuteStyleSwitch; // 0x1CAD5
	bool newEnable; // 0x1CAD6
	uint8 newAirStingerCount; // 0x1CAD7
	_(8);
	byte32 newEffectIndices[8]; // 0x1CAE0
	uint32 newLastVar; // 0x1CB00

	operator byte8 *()
	{
		return reinterpret_cast<byte8 *>(this);
	}
};

static_assert(offsetof(ActorData, status) == 8);
static_assert(offsetof(ActorData, character) == 0x78);
static_assert(offsetof(ActorData, position) == 0x80);
static_assert(offsetof(ActorData, pull) == 0x94);
static_assert(offsetof(ActorData, pullMultiplier) == 0xA4);
static_assert(offsetof(ActorData, rotation) == 0xC0);
static_assert(offsetof(ActorData, id) == 0x118);
static_assert(offsetof(ActorData, isClone) == 0x11C);
static_assert(offsetof(ActorData, visible) == 0x120);
static_assert(offsetof(ActorData, var_1C0) == 0x1C0);
static_assert(offsetof(ActorData, var_1C4) == 0x1C4);
static_assert(offsetof(ActorData, modelData) == 0x200);
static_assert(offsetof(ActorData, modelPhysicsMetadataPool) == 0x1880);
static_assert(offsetof(ActorData, modelAllocationDataCount) == 0x1B80);
static_assert(offsetof(ActorData, modelAllocationData) == 0x1B88);
